report_area > reports/area.rpt
report_area -hierarchy > reports/area_hier.rpt
report_power > reports/power.rpt
report_timing > reports/timing.rpt
